# Challenge

Another approach to identifying fraudulent transactions is to look for outliers in the data. Standard deviation or quartiles are often used to detect outliers. Using this starter notebook, code two Python functions:

* One that uses standard deviation to identify anomalies for any cardholder.

* Another that uses interquartile range to identify anomalies for any cardholder.

## Identifying Outliers using Standard Deviation

In [7]:
# Initial imports
import pandas as pd
import numpy as np
import random
from sqlalchemy import create_engine

In [8]:
# Create a connection to the database
engine = create_engine("postgresql://postgres:postgres@localhost:5432/fraud_detection")

In [9]:
# loading data of daily transactions from jan to jun 2018 for card holder 25
query = """
SELECT 
    a.id,
    a.name,
    b.card,
    c.date,
    c.amount,
    e.name as "category"
FROM 
    public.card_holder a
JOIN 
    public.credit_card b ON a.id = b.id_card_holder
JOIN 
    public.transaction c ON b.card = c.card
JOIN 
    public.merchant d ON c.id_merchant = d.id
JOIN 
    public.merchant_category e ON d.id_merchant_category = e.id;"""

tran_df = pd.read_sql(sql=query, con=engine, index_col='date', parse_dates='date')


# Write function that locates outliers using standard deviation
data_mean, data_std = np.mean(tran_df['amount']), np.std(tran_df['amount'])

# identify outliers using Empirical Rule 
bounds = data_std * 3 

lower, upper = data_mean - bounds, data_mean + bounds

# identify outliers
outliers = [x for x in tran_df['amount'] if x < lower or x > upper]

print('number of outliers: %d' % len(outliers))

# remove outliers
outliers_removed = [x for x in tran_df['amount'] if x >= lower and x <= upper]

print('Non-outlier observations: %d' % len(outliers_removed))

tran_df['outlier'] = (tran_df['amount'] > upper) | (tran_df['amount'] < lower)

outlier = tran_df[tran_df['outlier']==True]
outlier

number of outliers: 77
Non-outlier observations: 3423

,id,name,card,amount,category,outlier
date,,,,,,
2018-01-02 23:27:46,12,Megan Price,501879657465,1031.0,restaurant,True
2018-01-04 03:05:18,7,Sean Taylor,3516952396080247,1685.0,food truck,True
2018-01-08 02:34:32,6,Beth Hernandez,3581345943543942,1029.0,bar,True
2018-01-22 08:07:03,16,Crystal Clark,5570600642865857,1131.0,restaurant,True
2018-01-23 06:29:37,12,Megan Price,501879657465,1678.0,pub,True
...,...,...,...,...,...,...
2018-12-19 16:10:03,9,Laurie Gibbs,30181963913340,1724.0,pub,True
2018-12-21 09:56:32,24,Stephanie Dalton,30142966699187,1301.0,pub,True
2018-12-24 15:55:06,16,Crystal Clark,5570600642865857,1634.0,pub,True
2018-12-25 19:10:42,24,Stephanie Dalton,30142966699187,1035.0,pub,True
2018-12-30 23:23:09,1,Robert Johnson,4761049645711555811,1033.0,pub,True

In [10]:
# Find anomalous transactions for 3 random card holders
import datetime
start_time = datetime.time(7,0,0)
end_time = datetime.time(9,0,0)
num_random_anomalous = 3

std_anomalous = outlier.between_time(start_time, end_time).sort_values('amount', ascending=False)

# Get the total number of anomalous transactions
total_anomalous_transactions = len(std_anomalous)

# Ensure that the number of requested random transactions is not greater than the total
num_random_anomalous = min(num_random_anomalous, total_anomalous_transactions)

# Generate random indices to select random anomalous transactions
random_indices = random.sample(range(total_anomalous_transactions), num_random_anomalous)

# Select the randomly chosen anomalous transactions
std_random_anomalous = std_anomalous.iloc[random_indices]

std_random_anomalous

,id,name,card,amount,category,outlier
date,,,,,,
2018-09-06 08:28:55,1,Robert Johnson,4761049645711555811,1017.0,bar,True
2018-03-26 07:41:59,9,Laurie Gibbs,30181963913340,1009.0,coffee shop,True
2018-03-05 08:26:08,16,Crystal Clark,5570600642865857,1617.0,bar,True

## Identifying Outliers Using Interquartile Range

In [11]:
# Write a function that locates outliers using interquartile range
lower_quartile, upper_quartile = np.percentile(tran_df['amount'], 25), np.percentile(tran_df['amount'], 75)
iqr = upper_quartile - lower_quartile
print('Percentiles: lower quartile=%.3f, upper quartile=%.3f, IQR=%.3f' % (lower_quartile, upper_quartile, iqr))

# calculate the outlier bounds
bounds = iqr * 1.5
lower, upper = lower_quartile - bounds, upper_quartile + bounds

# identify outliers
iqr_outliers = [x for x in tran_df['amount'] if x < lower or x > upper]
print('Identified outliers: %d' % len(iqr_outliers))

# remove outliers
outliers_removed_2 = [x for x in tran_df['amount'] if x >= lower and x <= upper]
print('Non-outlier observations: %d' % len(outliers_removed_2))

tran_df['outlier'] = (tran_df['amount'] > upper) | (tran_df['amount'] < lower)

outlier_2 = tran_df[tran_df['outlier']==True]
outlier_2

Percentiles: lower quartile=3.735, upper quartile=14.648, IQR=10.913
Identified outliers: 110
Non-outlier observations: 3390

,id,name,card,amount,category,outlier
date,,,,,,
2018-01-02 23:27:46,12,Megan Price,501879657465,1031.0,restaurant,True
2018-01-04 03:05:18,7,Sean Taylor,3516952396080247,1685.0,food truck,True
2018-01-07 01:10:54,18,Malik Carlson,344119623920892,175.0,pub,True
2018-01-08 02:34:32,6,Beth Hernandez,3581345943543942,1029.0,bar,True
2018-01-08 11:15:36,18,Malik Carlson,344119623920892,333.0,restaurant,True
...,...,...,...,...,...,...
2018-12-21 09:56:32,24,Stephanie Dalton,30142966699187,1301.0,pub,True
2018-12-24 15:55:06,16,Crystal Clark,5570600642865857,1634.0,pub,True
2018-12-25 19:10:42,24,Stephanie Dalton,30142966699187,1035.0,pub,True
2018-12-28 16:20:31,3,Elizabeth Sawyer,30078299053512,313.0,pub,True
2018-12-30 23:23:09,1,Robert Johnson,4761049645711555811,1033.0,pub,True

In [12]:
# Find anomalous transactions for 3 random card holders
iqr_anomalous = outlier_2.between_time(start_time, end_time).sort_values('amount', ascending=False)


# Get the total number of anomalous transactions
total_anomalous_transactions = len(iqr_anomalous)

# Ensure that the number of requested random transactions is not greater than the total
num_random_anomalous = min(num_random_anomalous, total_anomalous_transactions)

# Generate random indices to select random anomalous transactions
random_indices = random.sample(range(total_anomalous_transactions), num_random_anomalous)

# Select the randomly chosen anomalous transactions
iqr_random_anomalous = iqr_anomalous.iloc[random_indices]

iqr_random_anomalous

,id,name,card,amount,category,outlier
date,,,,,,
2018-03-05 08:26:08,16,Crystal Clark,5570600642865857,1617.0,bar,True
2018-09-26 08:48:40,1,Robert Johnson,4761049645711555811,1060.0,restaurant,True
2018-01-22 08:07:03,16,Crystal Clark,5570600642865857,1131.0,restaurant,True